Alex Felipe Barbosa - 10/06/2024

Data Science Academy

Analise de Dados com Linguagem Python 
Projeto 1 - Diabetes 

Banco Relacional, Python e SQL para Analise de Dados

In [3]:
# Versão da Linguagem Python
from platform import python_version
print("Versão da Linguagem Python usada: ", python_version())

Versão da Linguagem Python usada:  3.11.7

In [5]:
# Instalar o pacote watermark
# Esse pacote é usado para gravar as versões dos outros pacotes usados neste Jupyter notebook
!pip install -q -U watermark

# Instala o pacote iPython-sql
!pip install -q ipython-sql

In [4]:
# Imports 
import pandas as pd
import sqlite3

In [5]:
# Versões dos pacotes usados neste jupyter notebook
%reload_ext watermark
%watermark -a "Data Science Academy" --iversions

Author: Data Science Academy

sqlite3: 2.6.0
pandas : 2.1.4

Banco Relacional, Python e SQL para Analise de Dados

In [6]:
# Cria um dataframe
dados = pd.DataFrame({'nome': ['Siri', 'Alexa', 'Cortana'],
                      'idade': [28, 47, 18],
                      'cargo': ['Analista de Dados', 'Cientista de Dados', 'Engenheiro de Dados']})

In [10]:
dados.head()

      nome  idade                cargo
0     Siri     28    Analista de Dados
1    Alexa     47   Cientista de Dados
2  Cortana     18  Engenheiro de Dados

In [7]:
# Apaga o banco de dados 
!del 'database/dbprojeto1.db'
#!rm 'database/dbprojeto1.db'

Op��o inv�lida - "dbprojeto1.db'".

In [8]:
# Criamos a conexão a um banco de dados SQLite
cnn = sqlite3.connect('database/dbprojeto1.db')

In [9]:
# Copia o dataframe para dentro do banco de dados como uma tabela
dados.to_sql('funcionarios', cnn)

3

In [10]:
# Carregamos a extensão SQL 
%load_ext sql

In [11]:
# Definimos o banco de dados
%sql sqlite:///database/dbprojeto1.db

Agora executamos nossas consultas SQL usando diretamente linguagem SQL dentro do Jupyter Notebook.

In [12]:
%%sql
Select * from funcionarios

 * sqlite:///database/dbprojeto1.db
Done.

[(0, 'Siri', 28, 'Analista de Dados'),
 (1, 'Alexa', 47, 'Cientista de Dados'),
 (2, 'Cortana', 18, 'Engenheiro de Dados')]

In [13]:
%%sql 
select count(*) from funcionarios

 * sqlite:///database/dbprojeto1.db
Done.

[(3,)]

In [14]:
%%sql
Select avg(idade) as 'idade_media' from funcionarios

 * sqlite:///database/dbprojeto1.db
Done.

[(31.0,)]